revolving_wing_cases/convergence_study/conv_ac05/backGround/system/FOfieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
fieldAverage
{
    type           fieldAverage;
    libs ("libfieldFunctionObjects.so");
    enabled        true;
    writeControl   writeTime;

    //writeControl   timeStep;
    //writeInterval  100;

    //cleanRestart true;

    //timeStart       20;
    //timeEnd         200;

    fields
    (
        U
        {
            mean        on;
            prime2Mean  on;
            base        time;
        }

        p
        {
	    mean        on;
	    prime2Mean  on;
	    base        time;
	}
    );
}

